app/controllers/superheros_controller.rb

  def index
    @heros = Superhero.all
---
SELECT "superheros".* FROM "superheros"

  def show
    @hero = Superhero.find(params[:id])
---
SELECT  "superheros".* FROM "superheros"  WHERE "superheros"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @hero = Superhero.new(hero_params)
    if @hero.save
---
INSERT INTO "superheros" ("image", "name", "super_power") VALUES ($1, $2, $3) RETURNING "id"  [["image", "http://static.comicvine.com/uploads/ignore_jpg_scale_small/1/10268/320468-116953-wonder-woman.jpg"], ["name", "Wonder Woman"], ["super_power", "Amazon Strength"]]